# Theme PK mapping and site configurations

ZEROWORLD_THEMES = {
    "1": {  # 김포본점
        "FEAR": "14",
        "해리포터의 모험 SE : 마법모자의 위기": "15",
        "검은사원 SE": "16",
        "피노키오 대탈출": "17",
        "복희네 사진관 SE": "18",
        "최면": "7",
        "성역전설": "19",
        "인형괴담": "20",
        "어느 겨울밤": "21",
        "탈옥 : 특별수용소": "22",
        "제로호텔": "23"
    },
    "4": {  # 강남점
        "아이엠": "28",
        "어느겨울밤2": "29",
        "콜러": "30",
        "나비효과": "31",
        "링": "32",
        "제로호텔L": "27",
        "DONE": "26",
        "포레스트 (FORREST)": "25",
        "헐!": "24"
    },
    "5": {  # 홍대점
        "사랑...하는...감?": "36",
        "깜방탈출": "35",
        "ALIVE": "34",
        "NOX": "33",
        "층간소음": "9"
    },
    "2": {  # 다이브 건대점
        "인터뷰 (26.07.29 이전)": "3",
        "인터뷰 (26.07.30 이후)": "39",
        "오르골": "38"
    }
}



JIGUBYEOL_THEMES = {
    "1": {  # 대구점
        "잉카": "20",
        "우리 아빠": "11",
        "사명 : 투쟁의 노래": "6",
        "펭귄키우기": "5",
        "너의 겨울은 가고, 봄은 온다": "3",
        "만월 <<꿈을 훔치는 요괴>>": "2",
        "단디해라": "1"
    },
    "2": {  # 홍대어드벤처점
        "PINOCCHIO(피노키오)": "25",
        "잔향": "23",
        "아몬 : 새벽을 여는 소년": "18",
        "퀘스트 : 여정의 시작": "17",
        "지난날을 잊었다": "9",
        "미스터리": "8"
    },
    "4": {  # 홍대라스트시티점
        "스텔라": "24",
        "카부트": "22",
        "alone(얼론)": "21",
        "라스트코어": "19",
        "纹身(문신)": "15",
        "멸종위기종 탐사대": "14",
        "스위티": "13",
        "섀도우": "12"
    }
}

PHOBIADUNGEON_THEMES = {
    "3": { # 홍대던전
        "사라진 보물 : 대저택의 비밀": "15",
        "날씨의 신 (홍대)": "14",
        "꿈의 공장 (홍대)": "13",
        "오늘 나는 (홍대)": "3"
    },
    "1": { # 던전101
        "화생설화 : Blooming": "1",
        "MST 엔터테인먼트": "7",
        "LET’S PLAY TOGETHER": "9",
        "전래동 자살사건": "6"
    },
    "5": { # 홍대던전Ⅲ
        "그달동네": "5",
        "이미지 세탁소": "17",
        "경성 연쇄실종사건": "19",
        "And I met E": "18"
    },
    "2": { # 강남던전
        "강남목욕탕": "2",
        "대호시장 살인사건": "10",
        "마음을 그려드립니다": "11",
        "LOST KINGDOM : 잊혀진 전설": "12"
    },
    "4": { # 강남던전Ⅱ
        "LOST KINGDOM2 : 대탐험의 시작": "4",
        "MAYDAY": "16"
    },
    "6": { # 던전루나
        "검은 운명의 밤": "8",
        "3일": "49"
    },
    "9": { # 던전스텔라
        "데스티니 앤드 타로": "50",
        "響 : 향": "51",
        "TIENTANG CITY": "59"
    },
    "7": { # 서면던전
        "오늘 나는 (부산 서면)": "36",
        "꿈의 공장 (부산 서면)": "37",
        "날씨의 신 (부산 서면)": "38"
    },
    "10": { # 서면던전 레드
        "어느 수집가의 집": "55",
        "AMEN": "56",
        "고시원 살인사건": "53",
        "당감동 정육점": "52",
        "부적": "57",
        "산장으로의 초대": "54"
    }
}

JIGUBYEOL_THEME_ALIASES = {
    "사명:투쟁의 노래": "사명 : 투쟁의 노래",
    "만월<<꿈을 훔치는 요괴>>": "만월 <<꿈을 훔치는 요괴>>",
    "아몬:새벽을 여는 소년": "아몬 : 새벽을 여는 소년",
    "퀘스트:여정의 시작": "퀘스트 : 여정의 시작",
    "紋身(문신)": "纹身(문신)"
}

KEYESCAPE_THEMES = {
    "26": {
        "Memory of Poppy": {
            "info_num": "71",
            "theme_num": "78"
        },
        "Memory of Tony": {
            "info_num": "72",
            "theme_num": "79"
        },
        "Memory of Ricky": {
            "info_num": "73",
            "theme_num": "80"
        }
    },
    "23": {
        "AYAKO": {
            "info_num": "63",
            "theme_num": "71"
        },
        "투투 어드벤쳐": {
            "info_num": "60",
            "theme_num": "69"
        },
        "괴록": {
            "info_num": "61",
            "theme_num": "70"
        }
    },
    "22": {
        "머니머니부동산": {
            "info_num": "43",
            "theme_num": "65"
        },
        "내 방": {
            "info_num": "44",
            "theme_num": "66"
        },
        "NOSTALGIA VISTA": {
            "info_num": "45",
            "theme_num": "67"
        }
    },
    "19": {
        "FOR FREE": {
            "info_num": "41",
            "theme_num": "63"
        },
        "머니머니패키지": {
            "info_num": "38",
            "theme_num": "60"
        }
    },
    "20": {
        "A GENTLE MONDAY": {
            "info_num": "42",
            "theme_num": "64"
        },
        "BACK TO THE SCENE+": {
            "info_num": "40",
            "theme_num": "61"
        }
    },
    "18": {
        "FILM BY EDDY": {
            "info_num": "34",
            "theme_num": "57"
        },
        "FILM BY STEVE": {
            "info_num": "35",
            "theme_num": "58"
        },
        "FILM BY BOB": {
            "info_num": "36",
            "theme_num": "59"
        }
    },
    "16": {
        "WANNA GO HOME": {
            "info_num": "33",
            "theme_num": "56"
        },
        "US": {
            "info_num": "31",
            "theme_num": "55"
        }
    },
    "14": {
        "엔제리오": {
            "info_num": "27",
            "theme_num": "51"
        },
        "네드": {
            "info_num": "26",
            "theme_num": "48"
        }
    },
    "3": {
        "그카지말라캤자나": {
            "info_num": "7",
            "theme_num": "7"
        },
        "살랑살랑연구소": {
            "info_num": "6",
            "theme_num": "6"
        },
        "월야애담-영문병행표기": {
            "info_num": "5",
            "theme_num": "5"
        }
    },
    "10": {
        "삐릿-뽀": {
            "info_num": "21",
            "theme_num": "41"
        },
        "홀리데이": {
            "info_num": "22",
            "theme_num": "45"
        },
        "고백": {
            "info_num": "23",
            "theme_num": "43"
        }
    },
    "9": {
        "난쟁이의 장난-영문병행표기": {
            "info_num": "10",
            "theme_num": "35"
        },
        "신비의숲 고대마법의 비밀": {
            "info_num": "9",
            "theme_num": "36"
        },
        "셜록 죽음의 전화": {
            "info_num": "11",
            "theme_num": "39"
        },
        "정신병동": {
            "info_num": "16",
            "theme_num": "37"
        },
        "파파라치": {
            "info_num": "18",
            "theme_num": "38"
        }
    },
    "7": {
        "살랑살랑연구소": {
            "info_num": "6",
            "theme_num": "30"
        },
        "월야애담-영문병행표기": {
            "info_num": "5",
            "theme_num": "29"
        },
        "혜화잡화점": {
            "info_num": "17",
            "theme_num": "31"
        },
        "사라진 목격자": {
            "info_num": "8",
            "theme_num": "33"
        }
    }
}

SITES_CONFIG = {
    "제로월드": {
        "url": "https://zeroworldkorea.com/layout/res/home.php?go=main",
        "branches": {
            "김포본점": "1",
            "강남점": "4",
            "홍대점": "5",
            "다이브 건대점": "2"
        },
        "has_weekday_weekend": False
    },
    "지구별방탈출": {
        "url": "https://www.xn--2e0b040a4xj.com",
        "branches": {
            "대구점": "1",
            "홍대어드벤처점": "2",
            "홍대라스트시티점": "4"
        },
        "has_weekday_weekend": False
    },
    "비트포비아 던전": {
        "url": "https://xdungeon.net/layout/res/home.php?go=rev.main",
        "branches": {
            "홍대던전": "3",
            "던전101": "1",
            "홍대던전Ⅲ": "5",
            "강남던전": "2",
            "강남던전Ⅱ": "4",
            "던전루나": "6",
            "던전스텔라": "9",
            "서면던전": "7",
            "서면던전 RED": "10"
        },
        "has_weekday_weekend": False
    },
    "키이스케이프": {
        "url": "https://www.keyescape.com/reservation.php",
        "branches": {
            "에버랜드": "26",
            "후즈데어": "23",
            "STATION": "22",
            "LOG_IN 1": "19",
            "LOG_IN 2": "20",
            "메모리컴퍼니": "18",
            "우주라이크": "16",
            "더오름": "14",
            "강남점": "3",
            "홍대점": "10",
            "부산점": "9",
            "전주점": "7"
        },
        "has_weekday_weekend": False
    },
    "둠이스케이프": {
        "url": "https://doomescape.com/layout/res/home.php?go=rev.make",
        "branches": {
            "1호점": "1",
            "2호점": "2",
            "DTH점(부평)": "3",
            "FEAR점(수원)": "4"
        },
        "has_weekday_weekend": False
    }
}

DOOMESCAPE_THEMES = {
    "1": {  # 1호점
        "Rendering": "8",
        "기담정": "27",
        "인앤아웃": "28",
        "나폴리탄": "29"
    },
    "2": {  # 2호점
        "운명": "30",
        "디스토피아": "31",
        "죄": "32",
        "인바이트": "33"
    },
    "3": {  # DTH점(부평)
        "슬래셔": "19",
        "트리거": "22",
        "언리얼": "24",
        "스네어": "25"
    },
    "4": {  # FEAR점(수원)
        "허수아비": "34",
        "옵스큐라": "35",
        "데이투어": "36"
    }
}
